// Напишите программу, которая принимает на вход число и выдаёт сумму цифр в числе//

Console.Write("Введите число: ");
int a = int.Parse(Console.ReadLine());
int sum = 0;
while (a > 0)
{
 
sum = sum + a % 10;
a = a /10 ;
 
}

Console.WriteLine("Сумма равна " + sum);

// не пойму что значит ошибка в этой задаче, хотя все работает

